# Brewfile for dotfiles setup
# Install with: brew bundle

# Taps
tap "homebrew/cask-fonts"

# CLI Tools
brew "git"
brew "zsh"
brew "wget"
brew "curl"
brew "neovim"
brew "eza"              # Modern replacement for ls
brew "fzf"              # Fuzzy finder
brew "bat"              # Better cat with syntax highlighting
brew "ripgrep"          # Fast grep alternative
brew "fd"               # Fast find alternative
brew "tldr"             # Simplified man pages
brew "tree"             # Directory tree viewer
brew "nvm"              # Node version manager
brew "jq"               # JSON processor
brew "gh"               # GitHub CLI

# Development Tools
brew "docker"
brew "docker-compose"

# Fonts
cask "font-meslo-lg-nerd-font"

# Applications
cask "alacritty"        # Terminal emulator
cask "visual-studio-code"
cask "docker"

# Optional: Uncomment if needed
# cask "google-chrome"
# cask "firefox"
# cask "slack"
# cask "spotify"
# cask "rectangle"      # Window management
# cask "alfred"         # Launcher
